app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
def avatars
    user = User.find(params[:id])

INSERT INTO "users" ("avatar_content_type", "avatar_file", "avatar_file_name", "avatar_file_size", "avatar_small_file", "avatar_thumb_file", "avatar_updated_at", "created_at", "email", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT id,name,email,created_at,updated_at,avatar_file_name,avatar_content_type,avatar_file_size,avatar_updated_at FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @user = User.find(params[:id])